Documents/НачислениеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>НачислениеПоЛС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоРегиональнымСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.РасшифровкаНачисленияЛьгот</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейНачислено</Name>
							<Comment>Дней начислено</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКонПериодаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачПериодаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтимулирующийТариф</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порог</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПорога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорогПорядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСубсидии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГраницаСубсидии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотребительУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Льготы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейНачислено</Name>
							<Comment>Дней начислено</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачПериодаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКонПериодаНазначения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Льготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотребительУслуг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧленовСемьи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтимулирующийТариф</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегиональнаяСубсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НачислениеПоЛС/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.НачислениеПоЛС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ПроведениеСервер.ОтразитьГарантированныеНачисленияСубсидий(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьРасчетыПоЛицевымСчетам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьРасшифровкаНачисленияЛьгот(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоСубсидиям(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьВзаиморасчетыПоЛьготам(ДополнительныеСвойства, Движения, Отказ);
	ПроведениеСервер.ОтразитьРегиональныеНачисленияСубсидий(ДополнительныеСвойства, Движения, Отказ);
    ПроведениеСервер.ОтразитьВзаиморасчетыПоРегиональнымСубсидиям(ДополнительныеСвойства, Движения, Отказ);
	
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.НачислениеПоЛС.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	Документы.НачислениеПоЛС.ВыполнитьКонтрольПовторногоНачисления(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль
	Документы.НачислениеПоЛС.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = Услуги.Итог("СуммаНачислено");
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ДЛЯ РАСЧЕТА ИЗ ОБРАБОТКИ

Процедура ЗаполнитьАвтоматическиНаСервере() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛицевыеСчета.ЛицевойСчет,
		|	ЛицевыеСчета.ЛицевойСчет.ОбъектЛицевогоСчета.Код КАК ЛицевойСчетОбъектЛицевогоСчетаКод
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета КАК ЛицевыеСчета
		|ГДЕ
		|	ЛицевыеСчета.Период >= &ДатаНач
		|	И ЛицевыеСчета.Период <= &ДатаКон
		|	И ЛицевыеСчета.ЛицевойСчет.Владелец = &Здание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет,
		|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет.ОбъектЛицевогоСчета.Код
		|ИЗ
		|	РегистрСведений.ЛицевыеСчета.СрезПоследних(
		|			&ДатаНач,
		|			ЛицевойСчет.Владелец = &Здание
		|				И Действует) КАК ЛицевыеСчетаСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчетОбъектЛицевогоСчетаКод";
		
		
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(ПериодНачисления));
	Запрос.УстановитьПараметр("Здание", Здание);
	
	ТаблицаДляЗагрузки	= Запрос.Выполнить().Выгрузить();
	
	Услуги.Загрузить(ТаблицаДляЗагрузки);
	
	РассчитатьСуммыНачислений();	
	
КонецПроцедуры

// Процедура - рассчитывает суммы начислений.
//
Процедура РассчитатьСуммыНачислений(ЛицевойСчет = Неопределено)
СтруктураДляРасчета = Новый Структура;
	
	Если ЛицевойСчет = Неопределено Тогда
		
		ТаблицаЛицевыхСчетов = Услуги.Выгрузить();
		ТаблицаЛицевыхСчетов.Свернуть("ЛицевойСчет",);
		СтруктураДляРасчета.Вставить("ЛицевыеСчета", ТаблицаЛицевыхСчетов.ВыгрузитьКолонку("ЛицевойСчет")); 
		
	Иначе
		МассивЛицевыхСчетов = Новый Массив();
		МассивЛицевыхСчетов.Добавить(ЛицевойСчет);
		СтруктураДляРасчета.Вставить("ЛицевыеСчета", МассивЛицевыхСчетов); 
		
	КонецЕсли;
	
	СтруктураДляРасчета.Вставить("ПериодНачисления", ПериодНачисления);
	СтруктураДляРасчета.Вставить("Услуга", Справочники.Услуги.ПустаяСсылка()); 
	
	СтруктураДляРасчета = УчетКоммунальныхУслуг.РассчитатьСуммыНачислений(СтруктураДляРасчета);
	
	Если СтруктураДляРасчета = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаУслуг = СтруктураДляРасчета.НоваяТаблицаУслуг;
	ТаблицаЛьгот = СтруктураДляРасчета.НоваяТаблицаЛьгот.Скопировать();
	
	ДнейВМесяце = День(КонецМесяца(ПериодНачисления));
	
	
	
	Если СтруктураДляРасчета.ЛицевыеСчета.Количество() > 1 Тогда
		Услуги.Загрузить(ТаблицаУслуг);
		Льготы.Загрузить(ТаблицаЛьгот);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЛьгот.ДатаКонПериодаНазначения,
		|	ТаблицаЛьгот.ДатаНачПериодаНазначения,
		|	ТаблицаЛьгот.ДнейНачислено,
		|	ТаблицаЛьгот.Количество,
		|	ТаблицаЛьгот.КоличествоРесурса,
		|	ТаблицаЛьгот.КоличествоЧленовСемьи,
		|	ТаблицаЛьгот.ЛицевойСчет,
		|	ТаблицаЛьгот.Льгота,
		|	ТаблицаЛьгот.ПотребительУслуг,
		|	ТаблицаЛьгот.ПроцентЛьготы,
		|	ТаблицаЛьгот.СтимулирующийТариф,
		|	ТаблицаЛьгот.СуммаЛьготы,
		|	ТаблицаЛьгот.Тариф,
		|	ТаблицаЛьгот.ТарифЛьгота,
		|	ТаблицаЛьгот.Услуга
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаЛьгот КАК ТаблицаЛьгот
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ.ДатаКонПериодаНазначения) КАК ДатаКонПериодаНазначения,
		|	МИНИМУМ(ВТ.ДатаНачПериодаНазначения) КАК ДатаНачПериодаНазначения,
		|	СУММА(ВТ.ДнейНачислено) КАК ДнейНачислено,
		|	СУММА(ВТ.КоличествоРесурса) КАК КоличествоРесурса,
		|	ВТ.КоличествоЧленовСемьи,
		|	ВТ.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТ.Льгота,
		|	ВТ.ПотребительУслуг,
		|	ВТ.ПроцентЛьготы,
		|	ВТ.Тариф,
		|	ВТ.Услуга КАК Услуга,
		|	СУММА(ВТ.Количество) КАК Количество,
		|	ВТ.СтимулирующийТариф,
		|	СУММА(ВТ.СуммаЛьготы) КАК СуммаЛьготы,
		|	ВТ.ТарифЛьгота
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ТарифЛьгота,
		|	ВТ.СтимулирующийТариф,
		|	ВТ.КоличествоЧленовСемьи,
		|	ВТ.Услуга,
		|	ВТ.ЛицевойСчет,
		|	ВТ.Льгота,
		|	ВТ.ПотребительУслуг,
		|	ВТ.ПроцентЛьготы,
		|	ВТ.Тариф
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет,
		|	Услуга,
		|	ДатаКонПериодаНазначения";
		
		Запрос.УстановитьПараметр("ТаблицаЛьгот",ТаблицаЛьгот);
		
		ТАбЛьготДляПоиска = Запрос.Выполнить().Выгрузить();
		
		
		Для каждого СтрокаТаблицыУслуг  Из Услуги Цикл
			
			Если СтрокаТаблицыУслуг.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ЛицевойСчет",СтрокаТаблицыУслуг.ЛицевойСчет);
				СтруктураПоиска.Вставить("Услуга",СтрокаТаблицыУслуг.Услуга);
				СтруктураПоиска.Вставить("ДатаНачПериодаНазначения",СтрокаТаблицыУслуг.ДатаНачПериодаНазначения);
				СтруктураПоиска.Вставить("ДатаКонПериодаНазначения",КонецДня(СтрокаТаблицыУслуг.ДатаКонПериодаНазначения));
				СтруктураПоиска.Вставить("ПотребительУслуг",СтрокаТаблицыУслуг.ПотребительУслуг);
				НайденнаяСтрока = ТАбЛьготДляПоиска.найтиСтроки(СтруктураПоиска);
				Если НайденнаяСтрока.Количество() <> 0 Тогда
					//Если НайденнаяСтрока[0].ДнейНачислено <> ДнейВМесяце Тогда
						СтрокаТаблицыУслуг.СуммаНачислено =  НайденнаяСтрока[0].СуммаЛьготы;
						СтрокаТаблицыУслуг.Количество =  НайденнаяСтрока[0].Количество;
					//КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
		
		КонецЦикла; 
		
		
		
	ИначеЕсли СтруктураДляРасчета.ЛицевыеСчета.Количество() = 1 Тогда	
		
		МассивСтрок = Услуги.НайтиСтроки(Новый Структура("ЛицевойСчет", СтруктураДляРасчета.ЛицевыеСчета[0]));
		Для каждого НайденнаяСтрока Из МассивСтрок Цикл
			Услуги.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
		Для каждого СтрокаТаблицыУслуг Из ТаблицаУслуг Цикл
			НоваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыУслуг);
			Если СтрокаТаблицыУслуг.ВидНачисления = Перечисления.ВидыНачислений.Льгота Тогда
			    СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("ЛицевойСчет",СтрокаТаблицыУслуг.ЛицевойСчет);
				СтруктураПоиска.Вставить("Услуга",СтрокаТаблицыУслуг.Услуга);
				СтруктураПоиска.Вставить("ДатаНачПериодаНазначения",СтрокаТаблицыУслуг.ДатаНачПериодаНазначения);
				СтруктураПоиска.Вставить("ДатаКонПериодаНазначения",СтрокаТаблицыУслуг.ДатаКонПериодаНазначения);
				СтруктураПоиска.Вставить("ПотребительУслуг",СтрокаТаблицыУслуг.ПотребительУслуг);
				НайденнаяСтрока = ТаблицаЛьгот.найтиСтроки(СтруктураПоиска);
				Если НайденнаяСтрока.Количество() <> 0 Тогда
					НоваяСтрока.СуммаНачислено =  НайденнаяСтрока[0].СуммаЛьготы;
					НоваяСтрока.Количество =  НайденнаяСтрока[0].Количество;
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла; 
		
		МассивСтрок = Льготы.НайтиСтроки(Новый Структура("ЛицевойСчет", СтруктураДляРасчета.ЛицевыеСчета[0]));
		Для каждого НайденнаяСтрока Из МассивСтрок Цикл
			Льготы.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
		Для каждого СтрокаТаблицыЛьгот Из ТаблицаЛьгот Цикл
			
			НоваяСтрока = Льготы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыЛьгот);
		
		КонецЦикла; 
		
	КонецЕсли; 
	
	СуммаДокумента = Услуги.Итог("СуммаНачислено");
	
КонецПроцедуры // РассчитатьСуммыНачислений()
